app/controllers/home_controller.rb

  def welcome
    @users = User.all
---
SELECT "users".* FROM "users"

  def main
    @users = User.all
---
SELECT "users".* FROM "users"