app/controllers/proposals_controller.rb

SELECT "proposals".* FROM "proposals" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "proposals"
---
  def index
    @proposals = Proposal.paginate(:per_page => 3, :page => params[:page]).search(params[:search])

SELECT "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT 1  [["id", "index"]]
---
  def show
    @proposal = Proposal.find(params[:id])

SELECT "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @proposal = Proposal.find(params[:id])

INSERT INTO "proposals" ("abstract", "coi_country", "coi_email", "coi_inst", "coi_name", "config", "coord_obs", "created_at", "cycle", "dec", "description", "flags", "instrument", "justify_dup", "keyword1", "keyword2", "keyword3", "magnitude", "observe_orb", "observe_target", "par_orb", "past_usage", "pi_country", "pi_email", "pi_inst", "pi_name", "prime_orb", "prop_category", "prop_pdf", "prop_period", "ra", "sci_category", "sci_justify", "special_req", "target", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @proposal = Proposal.new(params[:proposal])

    respond_to do |format|
      if @proposal.save

SELECT "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "proposals" SET "pi_inst" = 'Space Telescope Science Institute', "updated_at" = '2013-03-08 16:24:22.965252' WHERE "proposals"."id" = 2
---
  def update
    @proposal = Proposal.find(params[:id])

    respond_to do |format|
      if @proposal.update_attributes(params[:proposal])

SELECT "proposals".* FROM "proposals" WHERE "proposals"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "proposals" WHERE "proposals"."id" = ?  [["id", 1]]
---
  def destroy
    @proposal = Proposal.find(params[:id])
    @proposal.destroy