app/controllers/users_controller.rb

  def index
    authorize! :index, @user, :message => 'Not authorized as an administrator.'
    @users = User.paginate(:per_page => 3, :page => params[:page])
---
SELECT "users".* FROM "users" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "users"

  def update
    authorize! :update, @user, :message => 'Not authorized as an administrator.'
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

  def destroy
    authorize! :destroy, @user, :message => 'Not authorized as an administrator.'
    user = User.find(params[:id])
    unless user == current_user
      user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]